[
  {
    "id": "marta-anuncia-aposentadoria-da-selecao",
    "title": "Marta Anuncia Aposentadoria da Seleção Brasileira Após Paris 2024",
    "subtitle": "A Rainha do Futebol se despedirá da camisa amarelinha nos Jogos Olímpicos.",
    "content": "Em uma coletiva de imprensa emocionante, Marta Vieira da Silva, a maior jogadora de futebol de todos os tempos, confirmou que os Jogos Olímpicos de Paris 2024 serão sua última competição vestindo a camisa da Seleção Brasileira. A jogadora, que já foi eleita a melhor do mundo seis vezes, expressou sua gratidão pela jornada e a esperança de encerrar sua carreira internacional com uma medalha olímpica. 'É o fim de um ciclo, mas o começo de muitos outros para o futebol feminino. Dei tudo de mim por esta camisa e continuarei a apoiar de fora. Quero ver essa nova geração brilhar e conquistar o mundo', declarou Marta, emocionada. A decisão marca o fim de uma era de mais de 20 anos de dedicação e magia com a amarelinha.",
    "excerpt": "Após 20 anos defendendo o Brasil, Marta anuncia que Paris 2024 será sua despedida da Seleção. A decisão marca o fim de uma era dourada do futebol feminino nacional.",
    "coverImage": "https://blog.futfanatics.com.br/wp-content/uploads/2021/06/Marta-Destaque.png",
    "authorName": "Marina Costa",
    "authorAvatar": "/attached_assets/stock_images/female_soccer_player_1a88cd86.jpg",
    "publishedAt": "2025-09-24T08:30:00Z",
    "readTime": 5,
    "category": "news",
    "tags": ["Marta", "Seleção Brasileira", "Aposentadoria", "Paris 2024"],
    "featured": true,
    "trending": true,
    "reactions": {
      "likes": 2847,
      "comments": 312,
      "shares": 156
    },
    "relatedPlayer": {
      "name": "Marta Silva",
      "team": "Orlando Pride",
      "avatar": "https://conteudo.imguol.com.br/c/esporte/20/2021/07/23/marta-usou-o-cabelo-para-esconder-o-simbolo-da-nike-fornecedora-esportiva-da-cbf-1627057163253_v2_450x600.jpg"
    }
  },
  {
    "id": "classico-historico-brasileirao-feminino",
    "title": "Corinthians e Palmeiras Fazem Clássico Histórico Pelo Brasileirão Feminino",
    "subtitle": "Derby paulista emociona mais de 40 mil torcedores na Neo Química Arena em jogo decidido nos acréscimos.",
    "content": "O clássico entre Corinthians e Palmeiras pela 15ª rodada do Brasileirão Feminino cumpriu a promessa de ser um dos jogos mais importantes da temporada. Com ambas as equipes brigando pelo topo da tabela, a partida foi tensa do início ao fim. Gabi Portilho abriu o placar para o Corinthians no primeiro tempo, mas o Palmeiras buscou o empate com Bia Zaneratto na segunda etapa. Quando tudo parecia se encaminhar para o empate, um gol de falta magistral de Tamires nos acréscimos garantiu a vitória para o time alvinegro, para delírio da Fiel torcida que lotou o estádio.",
    "excerpt": "Neo Química Arena recebe mais de 40 mil torcedores para o maior clássico do futebol feminino brasileiro. Corinthians busca manter liderança.",
    "coverImage": "https://i.ytimg.com/vi/DROH3VjS428/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLAaZ3zAhTeZBtVyiF7LXxd-tt_9nw",
    "authorName": "Marina Costa",
    "authorAvatar": "/attached_assets/stock_images/female_soccer_player_1a88cd86.jpg",
    "publishedAt": "2025-09-22T16:45:00Z",
    "readTime": 3,
    "category": "match-report",
    "tags": ["Corinthians", "Palmeiras", "Brasileirão Feminino", "Clássico"],
    "featured": true,
    "trending": false,
    "reactions": {
      "likes": 1523,
      "comments": 89,
      "shares": 67
    }
  },
  {
    "id": "gabi-portilho-a-nova-estrela",
    "title": "Gabi Portilho: A Nova Estrela do Futebol Feminino Brasileiro",
    "subtitle": "Perfil da atacante que conquistou o coração da torcida corinthiana e se firmou na Seleção.",
    "content": "Aos 26 anos, Gabi Portilho se estabeleceu como uma das principais atacantes do futebol feminino brasileiro. Sua velocidade, drible e faro de gol têm sido cruciais para a campanha vitoriosa do Corinthians no Brasileirão. Este perfil explora sua jornada desde as categorias de base no interior de Minas Gerais, superando desafios e lesões, até se tornar uma peça fundamental tanto no clube quanto na Seleção Brasileira, inspirando uma nova geração de atletas com sua garra e talento.",
    "excerpt": "Com 18 gols em 20 jogos, Gabi Portilho se tornou a sensação do Corinthians e da Seleção Brasileira. Conheça sua trajetória inspiradora.",
    "coverImage": "https://img.olympics.com/images/image/private/t_s_pog_staticContent_hero_xl_2x/f_auto/primary/wwnlbntj074aygbekssm",
    "authorName": "Marina Costa",
    "authorAvatar": "/attached_assets/stock_images/female_soccer_player_1a88cd86.jpg",
    "publishedAt": "2025-09-21T14:20:00Z",
    "readTime": 7,
    "category": "feature",
    "tags": ["Gabi Portilho", "Corinthians", "Perfil", "Seleção Brasileira"],
    "featured": false,
    "trending": true,
    "reactions": {
      "likes": 892,
      "comments": 45,
      "shares": 23
    },
    "relatedPlayer": {
      "name": "Gabi Portilho",
      "team": "Corinthians",
      "avatar": "https://s2-g1.glbimg.com/UXzpwOPARDp1MdrMe8XcnO2s_94=/0x0:720x439/984x0/smart/filters:strip_icc()/i.s3.glbimg.com/v1/AUTH_59edd422c0c84a879bd37670ae4f538a/internal_photos/bs/2024/x/Z/iBANFFTH6yKMYDwLNTSw/gabi-portilho.jpeg"
    }
  },
  {
    "id": "cbf-anuncia-investimento-recorde",
    "title": "CBF Anuncia Investimento de R$ 50 Mi no Futebol Feminino",
    "subtitle": "Recursos serão destinados à base, infraestrutura e profissionalização da modalidade.",
    "content": "A Confederação Brasileira de Futebol anunciou hoje o maior investimento da história no futebol feminino nacional. O presidente da entidade, Ednaldo Rodrigues, detalhou que os R$ 50 milhões serão usados para fortalecer o calendário das competições de base (Sub-17 e Sub-20), melhorar a infraestrutura dos centros de treinamento dos clubes da Série A1 e A2, e implementar um programa de capacitação para treinadoras e árbitras, visando a profissionalização completa da modalidade no país. 'É um passo fundamental para garantir um futuro sustentável e vitorioso para o futebol feminino no Brasil', afirmou Rodrigues.",
    "excerpt": "CBF destina R$ 50 milhões para desenvolvimento do futebol feminino, focando em categorias de base e melhoria da infraestrutura dos clubes.",
    "coverImage": "https://objectstorage.sa-saopaulo-1.oraclecloud.com/n/grsa9ybqykir/b/portalcbf/o/54013680419_f6ebafa66a_o.jpg",
    "authorName": "Emily Silva",
    "authorAvatar": "/attached_assets/stock_images/female_soccer_player_2a3847ee.jpg",
    "publishedAt": "2025-09-20T10:15:00Z",
    "readTime": 4,
    "category": "news",
    "tags": ["CBF", "Investimento", "Infraestrutura", "Base"],
    "featured": false,
    "trending": true,
    "reactions": {
      "likes": 1647,
      "comments": 123,
      "shares": 89
    }
  }
]